Repository: gmgm60/user_profile_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: English
ar: اللغه العربيه

# appName
source: Profile
ar: الملف الشخضى

# firstScreenTitle
source: Profile App
ar: برنامج الملف الشخصى

# firstScreenText
source: Simple App to view and edit profile
ar: برنامج بسيط لعرض و تعديل الملف الشخصى

source: Log In
ar: تسجيل دخول

source: Sign Up
ar: تسجيل عضويه

# logInText
source: Welcome Back
ar: مرحبا مجددا

source: Email
ar: البريد الالكترونى

source: Password
ar: كلمة السر

source: Or
ar: او

# signUpText
source: Create Account
ar: أنشاء حساب جديد

source: Name
ar: الاسم

# viewProfileTitle
source: View Profile
ar: عرض الملف الشخضى

source: Address
ar: العنوان

source: Phone
ar: رقم الهاتف

source: Age
ar: العمر

# cropImage
source: Crop your image
ar: قص الصوره

source: Update Profile
ar: تحديث البيانات

source: Edit Profile
ar: تعديل الملف الشخصى

# passwordValidate
source: password must be more than 6
ar: كلمة السر يجب ان تكون اكبر من ٦ احرف

source: Invalid Email Address!
ar: البريد الالكترونى ليس صحيح

# nameValidate
source: Name must be more than 6
ar: الاسم يجب ان يكون اكثر من ٦ احرف

# addressValidate
source: Address must be more than 6
ar: العنوان يجب ان يكون اكثر من ٦ احرف

# phoneValidate
source: Phone must be more than 11
ar: رقم الهاتف ليس صحيح

# ageValidateLimits
source: age must be number between 10 and 100
ar: العمر يجب ان يكون اكبر من ١٠ سنوات و اقل من ١٠٠ سنه

# ageValidate
source: Not valid Age
ar: برجاء ادخال عمر صحيح
